# -*- coding: utf-8 -*-
"""
Spyder Editor
练习题1：
定义一个天气温度列表，写出里面每一天的温度
打印一周的天气，遇到周三就加上温度，周三+温度
练习题2:
定义一个字典（map）,里面存储天的天气信息，有温度，天气情况
打印星期三的温度和天气情况
This is a temporary script file.
"""
print('练习题1')
weather=['15℃','18℃','17℃','25℃','18℃','19℃','11℃','1℃']
print('一周的天气:')
print(weather[0])
print(weather[1])
print('星期三:',weather[2])
print(weather[3])
print(weather[4])
print(weather[5])
print(weather[6])
        
print()
print('练习题2')
map={'星期一':{'温度':'31℃','天气情况':'热'},
     '星期二':{'温度':'32℃','天气情况':'热'},
     '星期三':{'温度':'33℃','天气情况':'炎热'},
     '星期四':{'温度':'34℃','天气情况':'热'},
     '星期五':{'温度':'35℃','天气情况':'热'},
     '星期六':{'温度':'30℃','天气情况':'热'},
     '星期日':{'温度':'39℃','天气情况':'热'}
}
print('星期三的温度:',map['星期三']['温度'],'天气情况:',map['星期三']['天气情况'])


